
GetPassphraseDescription = "Anda perlu suatu kata sandi untuk membuka kunci rahasia bagi pengguna: \"%@\", ID %@";
GetPassphraseDescription_Subkey = "Anda perlu suatu kata sandi untuk membuka kunci rahasia bagi pengguna: \"%@\", ID %@, (ID kunci utama %@)";
PassphraseLabel = "Kata sandi:";




/* For Key-Status */
"Invalid" = "Tidak valid";
"Revoked" = "Dicabut";
"Expired" = "Kedaluwarsa";
"Disabled" = "Dinonaktifkan";
"Unknown" = "Tak diketahui";
"Never" = "Jangan Pernah";
"Marginal" = "Terbatas";
"Full" = "Penuh";
"Ultimate" = "Tertinggi";


/* For Undo and Redo */
Undo_NewKey = "Kunci Baru";
Undo_Delete = "Hapus";
Undo_CleanKey = "Bersih";
Undo_MinimizeKey = "Minimalkan";
Undo_RevokeKey = "Cabut Kunci";
Undo_ChangeExpirationDate = "Ubah Tanggal Kedaluwarsa";
Undo_ChangePassphrase = "Ubah Kata Sandi";
Undo_AlgorithmPreferences = "Ubah Preferensi Algoritma";
Undo_Import = "Impor";
Undo_AddSignature = "Tambah Tanda Tangan";
Undo_RemoveSignature = "Buang Tanda Tangan";
Undo_RevokeSignature = "Cabut Tanda Tangan";
Undo_AddSubkey = "Tambah Sub Kunci";
Undo_RemoveSubkey = "Buang Sub Kunci";
Undo_RevokeSubkey = "Cabut Sub Kunci";
Undo_AddUserID = "Tambah UserID";
Undo_RemoveUserID = "Buang UserID";
Undo_RevokeUserID = "Cabut UserID";
Undo_PrimaryUserID = "UserID Primer";
Undo_AddPhoto = "Tambah Foto";
Undo_RefreshFromServer = "Segarkan dari server";
Undo_ReceiveFromServer = "Terima dari server";



/* Algorithm names */
CIPHER_ALGO_NONE = "Nihil";
CIPHER_ALGO_IDEA = "IDEA";
CIPHER_ALGO_3DES = "3DES";
CIPHER_ALGO_CAST5 = "CAST5";
CIPHER_ALGO_BLOWFISH = "BLOWFISH";
CIPHER_ALGO_AES = "AES";
CIPHER_ALGO_AES192 = "AES192";
CIPHER_ALGO_AES256 = "AES256";
CIPHER_ALGO_TWOFISH = "TWOFISH";
CIPHER_ALGO_CAMELLIA128 = "CAMELLIA128";
CIPHER_ALGO_CAMELLIA192 = "CAMELLIA192";
CIPHER_ALGO_CAMELLIA256 = "CAMELLIA256";
DIGEST_ALGO_MD5 = "MD5";
DIGEST_ALGO_SHA1 = "SHA1";
DIGEST_ALGO_RMD160 = "RMD160";
DIGEST_ALGO_SHA256 = "SHA256";
DIGEST_ALGO_SHA384 = "SHA384";
DIGEST_ALGO_SHA512 = "SHA512";
DIGEST_ALGO_SHA224 = "SHA224";
COMPRESS_ALGO_NONE = "Nihil";
COMPRESS_ALGO_ZIP = "ZIP";
COMPRESS_ALGO_ZLIB = "ZLIB";
COMPRESS_ALGO_BZIP2 = "BZIP2";

GPG_RSAAlgorithm = "RSA";
GPG_RSAEncryptOnlyAlgorithm = "RSA-E";
GPG_RSASignOnlyAlgorithm = "RSA-S";
GPG_ElgamalEncryptOnlyAlgorithm = "ELG-E";
GPG_DSAAlgorithm = "DSA";
GPG_ECDHAlgorithm = "ECDH";
GPG_ECDSAAlgorithm = "ECDSA";
GPG_ElgamalAlgorithm = "ELG";
GPG_DiffieHellmanAlgorithm = "DiffieHellman";
GPG_EdDSAAlgorithm = "EdDSA";
"Algorithm_%i" = "Algoritma_%i";

/* GPGSignature humanReadableDescription */
"Signed" = "Ditandatangani";
"Signature expired" = "Tanda tangan kedaluwarsa";
"Key expired" = "Kunci kedaluwarsa";
"Bad signature" = "Tanda tangan dan data tidak cocok. Ini bisa berarti bahwa data telah dirusak.";
"Signature revoked" = "Tanda tangan dicabut";
"Signature error" = "Kesalahan tanda tangan";
"Unverifiable signature" = "Tanda tangan tidak bisa diverifikasi.";
"Signed by stranger" = "Tanda tangan tidak bisa diverifikasi, karena kunci publik yang berhubungan hilang.";


/* Key Descriptions */
KeyDescriptionAndMore = "dan %lu lagi";


/* Key Expiry Warning */
KeyExpiryWarning_Title = "Peringatan: Kunci Anda akan kedaluwarsa";
KeyExpiryWarning_Msg = "Kunci Anda akan kedaluwarsa pada %1$@:\n\n%2$@\n\nKunci yang kedaluwarsa tidak dapat dipakai untuk mengenkripsi atau menandatangani pesan-pesan baru. Dekripsi dapat terus dilakukan. Teman-teman Anda tidak akan dapat mengirim pesan terenkripsi memakai kunci ini.\n\nBila Anda memilih untuk memperpanjang kunci, itu akan valid selama dua tahun mendatang.\n\nApakah Anda hendak memperpanjang kunci Anda?";
KeyExpiryWarning_Yes = "Perpanjang Kunci";
KeyExpiryWarning_No = "Batal";
KeyExpiryWarning_Suppress = "Jangan Tanya Lagi";

SubkeyExpiryWarning_Title = "Peringatan: Sub kunci Anda akan kedaluwarsa";
SubkeyExpiryWarning_Msg = "Sub kunci Anda akan kedaluwarsa pada %1$@:\n\n%2$@\n\nSub kunci yang kedaluwarsa tidak dapat dipakai untuk mengenkripsi atau menandatangani pesan-pesan baru. Dekripsi dapat terus dilakukan. Teman-teman Anda tidak akan dapat mengirim pesan terenkripsi memakai sub kunci ini.\n\nBila Anda memilih untuk memperpanjang sub kunci, itu akan valid selama dua tahun mendatang.\n\nApakah Anda hendak memperpanjang sub kunci Anda?";
SubkeyExpiryWarning_Yes = "Perpanjang Sub Kunci";
SubkeyExpiryWarning_No = "Batal";
SubkeyExpiryWarning_Suppress = "Jangan Tanya Lagi";

WrongPasswordTryAgain_Title = "Anda memasukkan kata sandi yang salah";
WrongPasswordTryAgain_Msg = "Apakah Anda hendak mencoba lagi?";
WrongPasswordTryAgain_Yes = "Coba Lagi";
WrongPasswordTryAgain_No = "Batal";

KeyExpiryFailed_Title = "Gagal memperpanjang kunci Anda!";
KeyExpiryFailed_Msg = "Kunci\n%1$@\ntidak dapat diperpanjang\n\nGalat: %2$@";

KeyExtendedWantToUpload_Title = "Kunci Anda sukses diperpanjang";
KeyExtendedWantToUpload_Msg = "Agar orang lain dapat melihat tanggal kedaluwarsa baru, mereka perlu mengimpor kunci mutakhir Anda. Maka disarankan untuk mengunggah kunci publik Anda yang mutakhir ke server kunci.\n\nPeringatan: Server kunci adalah publik, sehingga nama dan surel yang Anda pakai dalam kunci Anda akan tampak secara publik. Kunci-kunci tidak dapat dihapus dari server kunci. Mereka bisa dicabut tapi tidak dihapus.\n\nBila Anda lebih suka untuk tidak memakai server kunci, harap pertimbangkan untuk melampirkan kunci publik Anda ke surel Anda yang ditandatangani dan dienkripsi.\n\nApakah Anda hendak mengunggah kunci publik Anda?";
KeyExtendedWantToUpload_Yes = "Unggah Kunci Publik";
KeyExtendedWantToUpload_No = "Tidak, Terima kasih!";

UploadFailed_Title = "Gagal mengunggah kunci!";
UploadFailed_Msg = "Kunci tidak dapat diunggah ke server kunci.\n\nGalat: %@";


UpdaterNotWorking_Title = "Pemutakhir Keluarga GPG tak bekerja seperti yang diharapkan!";
UpdaterNotWorking_Msg = "Harap unduh dan pasang ulang Keluarga GPG dari https://gpgtools.org";


SwitchToOldKeyserver_Title = "Peringatan: Anda akan berganti server kunci";
SwitchToOldKeyserver_Msg = "Bertukar ke server kunci lama akan menurunkan kualitas hasil pencarian. Walaupun keys.openpgp.org mengizinkan verifikasi alamat surel dan kemudian akan menampilkan surel dalam hasil pencarian, server kunci lama tidak mendukung mekanisme itu.\n\nKami menyarankan untuk tetap memakai keys.openpgp.org\n\nApakah Anda yakin hendak berganti server kunci?";
SwitchToOldKeyserver_No = "Batal";
SwitchToOldKeyserver_Yes = "Bertukar ke Server Kunci lama";


